## MOTIVATING PANDAS PIVOT TABLES
      In Pandas, a Pivot Table is used to summarize and analyze data by organizing it into a table format 
      based on selected rows, columns, and aggregation functions.
    
        The pivot_table() function allows you to:
        - Group data by rows and columns
        - Apply aggregate functions such as mean, sum, count, max, or min
        - Perform multi-dimensional data analysis

In [3]:
import pandas as pd

In [5]:
df = pd.read_csv("C:\\Users\\Dell\\Desktop\\_PANDAS_\\Data\\movie_ratings.csv")
df.head(2)

    Genre  Year  Budget(M$)  Ratings %
0  Action  2008          28         48
1  Action  2009         200         63

In [20]:
# Instead of head() we use sample()
df.sample(3)

    Genre  Year  Budget(M$)  Ratings %
2  Action  2008          32         57
9  Comedy  2009          30         71
7  Comedy  2010          27         70

### --- Basic Pivot Tables ---

In [15]:
# Create a pivot table using 'Genre' as the row index
# By default, this calculates the mean (average) for numeric columns
df.pivot_table(index= 'Genre')

           Budget(M$)  Ratings %     Year
Genre
Action      70.000000       55.0  2008.75
Adventure   62.500000       64.0  2009.50
Comedy      21.666667       74.0  2009.00

In [17]:
# Pivot the data with 'Genre' as rows and 'Year' as columns
# This displays averages for each category across specific years
df.pivot_table(index= 'Genre',columns='Year')

          Budget(M$)              Ratings %
Year            2008   2009  2010      2008  2009  2010
Genre
Action          30.0  200.0  20.0      52.5  63.0  52.0
Adventure        NaN  105.0  20.0       NaN  84.0  44.0
Comedy           8.0   30.0  27.0      81.0  71.0  70.0

### --- Using Aggregation Functions ---

In [20]:
# Use 'aggfunc' to specify different calculations like 'min', 'count', or 'mean'
# Find the minimum value for each group
df.pivot_table(index= 'Genre',columns='Year',aggfunc='min')

          Budget(M$)              Ratings %
Year            2008   2009  2010      2008  2009  2010
Genre
Action          28.0  200.0  20.0      48.0  63.0  52.0
Adventure        NaN  105.0  20.0       NaN  84.0  44.0
Comedy           8.0   30.0  27.0      81.0  71.0  70.0

In [22]:
# Count the number of occurrences in each category
df.pivot_table(index= 'Genre',columns='Year',aggfunc='count')

          Budget(M$)           Ratings %
Year            2008 2009 2010      2008 2009 2010
Genre
Action           2.0  1.0  1.0       2.0  1.0  1.0
Adventure        NaN  1.0  1.0       NaN  1.0  1.0
Comedy           1.0  1.0  1.0       1.0  1.0  1.0

In [24]:
# Calculate the mean explicitly
df.pivot_table(index= 'Genre',columns='Year',aggfunc='mean')

          Budget(M$)              Ratings %
Year            2008   2009  2010      2008  2009  2010
Genre
Action          30.0  200.0  20.0      52.5  63.0  52.0
Adventure        NaN  105.0  20.0       NaN  84.0  44.0
Comedy           8.0   30.0  27.0      81.0  71.0  70.0

### --- Handling Missing Data & Totals ---

In [10]:
df = pd.read_csv("C:\\Users\\Dell\\Desktop\\_PANDAS_\\Data\\movie_ratings_NaN.csv")
df.head(2)

    Genre  Year  Budget(M$)  Ratings %
0  Action  2008          28         48
1  Action  2009         200         63

In [27]:
# Use 'fill_value' to replace NaN results with a specific value (e.g., 0)
df.pivot_table(index= 'Genre',columns='Year',aggfunc='mean',fill_value='0')

C:\Users\Dell\AppData\Local\Temp\ipykernel_7412\2997007152.py:2: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df.pivot_table(index= 'Genre',columns='Year',aggfunc='mean',fill_value='0')

          Budget(M$)              Ratings %
Year            2008   2009  2010      2008  2009  2010
Genre
Action          30.0  200.0  20.0      52.5  63.0  52.0
Adventure          0  105.0  20.0         0  84.0  44.0
Comedy           8.0   30.0  27.0      81.0  71.0  70.0

In [29]:
# Use 'margins=True' to add an 'All' row and column showing grand totals/averages
df.pivot_table(index= 'Genre',columns='Year',aggfunc='mean',margins=True)

          Budget(M$)                                   Ratings %             \
Year            2008        2009       2010        All      2008       2009
Genre
Action     30.000000  200.000000  20.000000  70.000000      52.5  63.000000
Adventure        NaN  105.000000  20.000000  62.500000       NaN  84.000000
Comedy      8.000000   30.000000  27.000000  21.666667      81.0  71.000000
All        22.666667  111.666667  22.333333  52.222222      62.0  72.666667


Year            2010        All
Genre
Action     52.000000  55.000000
Adventure  44.000000  64.000000
Comedy     70.000000  74.000000
All        55.333333  63.333333

In [31]:
# Find the maximum values while also displaying grand totals
df.pivot_table(index= 'Genre',columns='Year',aggfunc='max',margins=True)

          Budget(M$)                   Ratings %
Year            2008   2009  2010  All      2008  2009  2010 All
Genre
Action          32.0  200.0  20.0  200      57.0  63.0  52.0  63
Adventure        NaN  105.0  20.0  105       NaN  84.0  44.0  84
Comedy           8.0   30.0  27.0   30      81.0  71.0  70.0  81
All             32.0  200.0  27.0  200      81.0  84.0  70.0  84